[
    {
      "id": 1,
      "name": "Braquiosaurio",
      "nameMeaning": "Lagarto del brazo",
      "type": "Hervíboro",
      "weight": "33000 a 88000 kilogramos",
      "length": "26-30 metros",
      "height": "12 a 15 metros",
      "historicalPeriod": "Vivió en el Período Jurásico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676021958/Brachiosaurus_rotado_svztlb.png",
      "foundIn": ["Algeria", "Portugal", "Tanzania", "USA"],
      "diet": "Ginkgos, coníferas, helechos arborescentes y cicadáceas grandes (de gran variedad de plantas)",
      "characteristics": "Tiene el cuello extremadamente largo, un cráneo pequeño y gran tamaño general, todos los cuales son rasgos típicos de los saurópodos. Su apariencia se parecía a la apariencia de la jirafa moderna",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanuras del bosque",
      "facts": [
        "Tenía las extremidades delanteras más largas que las traseras.", 
        "Los adultos podrían vivir hasta los 100 años.", 
        "Probablemente fue un homeotermo (temperatura corporal relativamente constante en cualquier momento del día).", 
        "Los restos fósiles fueron encontrados en 1903.", 
        "Ha aparecido en varios documentales y películas, como Walking with Dinosaurs , Jurassic Park, etc."]
    },
    {
      "id": 2,
      "name": "Diplodocus",
      "nameMeaning": "Doble viga",
      "type": "Hervíboro",
      "weight": "30000 a 50000 kilogramos",
      "length": "36 metros",
      "height": "4,8 metros",
      "historicalPeriod": "Vivió en el Período Jurásico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676021958/diplodocus_rotado_umqn3v.png",
      "foundIn": ["USA"],
      "diet": "Àrboles, arbustos, cícadas, ginkgos y helechos (hierba, arbustos pequeños y hojas de árboles)",
      "characteristics": "Está entre los dinosaurios más fácilmente identificables, con su forma clásica, cuello y cola largos, y cuatro patas robustas. Durante muchos años, era el dinosaurio más grande conocido. Se cree que eran criaturas terrestres que vivían en manadas",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanura aluvial o entorno pantanoso",
      "facts": [
        "El cuello y la cola constaban de casi 100 vértebras.",
        "No era el dinosaurio más inteligente del bloque jurásico.", 
        "Probablemente mantuvo su cuello largo al nivel del suelo.", 
        "El nombre artístico del DJ estadounidense, productor discográfico, rapero y compositor Thomas Wesley Pentz, Diplo, está inspirado en Diplodocus."]
    },
    {
      "id": 3,
      "name": "Stegosaurus",
      "nameMeaning": "Lagarto de techo",
      "type": "Hervíboro",
      "weight": "3800 a 7000 kilogramos",
      "length": "9 metros",
      "height": "4 metros",
      "historicalPeriod": "Vivió en el Período Jurásico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676035623/stegosaurus_qhwwux.png",
      "foundIn": ["África, Asia, Europa y Norteamérica"],
      "diet": "Comía plantas, en gran parte coníferas, helechos y helechos con semillas",
      "characteristics": "Muy popular por las placas que recorrían todo su cuerpo desde la cabeza a la cola, y cuya función le permitía regular la temperatura corporal, el Estegosaurio también se caracterizaba por un grupo de espinas gigantes en el extremo de la cola, muy utilizadas para defenderse  la espalda plateada.  O tenía una distintiva e inusual postura, con un lomo fuertemente arqueado, los miembros anteriores cortos, la cabeza cerca del suelo y la cola rígida sostenida en el aire",
      "locomotion": "Cuadrúpedo",
      "habitat": "Bosques o llanuras",
      "facts": [
        "Tenía un cerebro del tamaño de una nuez.",
        "Los paleontólogos alguna vez pensaron que tenía un cerebro en su trasero.", 
        "Complementó su dieta con pequeñas rocas.", 
        "Vivían en manadas formadas por adultos y bebés.",
        "Alguna vez se pensó que caminaba sobre dos patas."]
    },
    {
      "id": 4,
      "name": "Triceratops",
      "nameMeaning": "Cara de tres cuernos",
      "type": "Hervíboro",
      "weight": "6100 a 12000 kilogramos",
      "length": "7,9 a 9 metros",
      "height": "3 metros",
      "historicalPeriod": "Vivió a finales del Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676035213/triceraptor_islqjb.png",
      "foundIn": ["USA"],
      "diet": "Plantas de crecimiento bajo",
      "characteristics": "Estaba dotado de unos impresionantes cuernos y una placa frontal. Utilizaba sus cuernos, uno corto sobre la boca y dos largos sobre sus ojos para embestir contra depredadores como el T. rex. Probablemente también eran utilizados en rituales de apareamiento",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanuras del bosque",
      "facts": [
        "El cráneo era un tercio de su cuerpo.",
        "Fue considerado alimento para Tyrannosaurus Rex.", 
        "Tenía un pico duro como el de un loro.", 
        "La apariencia era en gran medida como la del rinoceronte moderno.",
        "Los fósiles son artículos preciados de coleccionista."]
    },
    {
      "id": 5,
      "name": "Protoceratops",
      "nameMeaning": "Primera cara con cuernos",
      "type": "Hervíboro",
      "weight": "23700 a 82700 kilogramos",
      "length": "1,8 metros",
      "height": "60 centímetros",
      "historicalPeriod": "Vivió a finales del Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676035213/protoceraptor_mxszhl.png",
      "foundIn": ["En el desierto de Gobi en Mongolia"],
      "diet": "Se alimentaba de las hojas de los arboles pequeños sobre todo de hojas ricas en fibras",
      "characteristics": "Era un dinosaurio relativamente pequeño con una enorme cabeza. Aunque fue un herbívoro, parece haber tenido una poderosa mordida. Estas mandíbulas tenían grandes baterías de dientes bien adaptados para masticar la vegetación resistente",
      "locomotion": "Cuadrúpedo",
      "habitat": "Hábitat árido y seco con fauna y flora diversa",
      "facts": [
        "Estaba en el menú de la cena de Velociraptor.",
        "Compartió su hábitat con Oviraptor.", 
        "Roy Chapman Andrews los descubrió.", 
        "Los lechos de huesos fosilizados indican que vivían en manada.",
        "Tenía un pico de loro y dientes en las mejillas."]
    },
    {
      "id": 6,
      "name": "Troodon",
      "nameMeaning": "Diente hiriente",
      "type": "Carnívoro",
      "weight": "45 a 50 kilogramos",
      "length": "2 a 3,3 metros",
      "height": "70 a 90 centímetros",
      "historicalPeriod": "Vivió en el Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676036401/Troodon_ww1de9.png",
      "foundIn": ["América del norte"],
      "diet": "Se alimentaba de pequeños invertebrados, mamíferos y reptiles",
      "characteristics": "Sus características anatómicas sugieren que eran verdaderos depredadores en su hábitat. Sus hallazgos fósiles cerca del norte, e incluso áreas árticas determinan que preferían regiones más frías. Sus estrategias reproductivas eran en parte similares a las de los cocodrilos y las aves. Los investigadores sugirieron que Troodon produjo dos huevos a intervalos periódicos durante unos diez días y los incubaron en nidos en el suelo. Eran corredores rápidos y probablemente llevaban un estilo de vida en parte nocturno",
      "locomotion": "Bípedo",
      "habitat": "Bosques de lo que hoy es Norteamérica",
      "facts": [
        "Tenía un cerebro más grande que la mayoría de los dinosaurios.",
        "Prosperó en climas más fríos.", 
        "Puso nidadas de 16 a 24 huevos a la vez.", 
        "Tenía visión binocular.",
        "Podría haber desarrollado un nivel humano de inteligencia.",
        "Se representaba como un dinosaurio con la piel desnuda. Pero los investigadores modernos sugieren que su cuerpo estaba cubierto de plumas primitivas."]
    },
    {
      "id": 7,
      "name": "Utahraptor",
      "nameMeaning": "Ladrón de Utah",
      "type": "Carnívoro",
      "weight": "499 kilogramos",
      "length": "5 a 7 metros",
      "height": "1,7 metros",
      "historicalPeriod": "Vivió en el Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676056898/utahraptors_oqfgwu.png",
      "foundIn": ["USA"],
      "diet": "Se alimentaba de otros dinosaurios y algunos mamíferos que cazaban",
      "characteristics": "Era un dinosaurio con un cuerpo lo bastante adaptado para ser ágil y rápido, además, poseía una característica muy inusual, ya que tenía unos brazos relativamente largos y al final tenía unas garras los bastante afiladas que sin duda representan una gran ventaja al momento de cazar, debido a que seguramente le facilitaba agarrar sus presas. es considerado uno de los mejores depredadores de la historia junto a otros especímenes, ya que estaba dotado con todo lo necesario para hacer frente a cualquier presa, y es que la velocidad combinada con su gran equipamiento de garras y dientes no dejó indiferente a los amantes de la prehistoria",
      "locomotion": "Bípedo",
      "habitat": "Bosques, praderas y desiertos",
      "facts": [
        "Es el raptor más grande descubierto hasta ahora.",
        "Las garras en las patas traseras tenían casi un pie de largo.", 
        "Es la estrella de la novela 'Raptor Red'.", 
        "Actualmente en muchas ilustraciones se plasma al Utahraptor con plumas, sin embargo, esto es solo especulación y no está probado. Ya que no se encontraron signos de plumas.",
        "Este cazador también está presente en el juego de ordenador 'ARK: supervivencia con dinosaurios'."
      ]
    },
    {
      "id": 8,
      "name": "Velociraptor",
      "nameMeaning": "Ladrón o saqueador rápido",
      "type": "Carnívoro",
      "weight": "13 a 15 kilogramos",
      "length": "2 metros",
      "height": "48 centímetros",
      "historicalPeriod": "Vivió en el Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676117122/velociraptor_ozmt2f.png",
      "foundIn": ["Mongolia y China"],
      "diet": "Probablemente se alimentaron de animales como el Protoceratops de forma regular, posiblemente tanto de su carroña como cazándolos",
      "characteristics": "Eran dinosaurios emplumados bípedos con una cola larga y una garra en forma de hoz en cada pata trasera. Tenían un cuello en forma de S y su cabeza medía 7 pulgadas de largo. Tenían 26-28 dientes a cada lado de la mandíbula. A diferencia de otros dromeosáuridos, los Velociraptors tenían un cráneo bajo y largo junto con un hocico angosto, largo y poco profundo que cubría alrededor del 60% de la longitud de su cráneo. Su cola, formada por huesos duros y fusionados, era inflexible",
      "locomotion": "Bípedo",
      "habitat": "Desierto seco con dunas de arena",
      "facts": [
        "Tuvo un papel 'prominente' en las películas de “Jurassic Park”. Pero los científicos dicen que su representación de Hollywood no se parecía a su tamaño o apariencia real.",
        "El primer fósil fue descubierto en agosto de 1923 por Peter Kaisen, en la primera excursión del Museo Americano de Historia Natural en busca de Velociraptor al Desierto de Gobi de Mongolia Exterior.", 
        "Los científicos creen que los velocirraptores fueron enterrados en la arena, ya sea por una tormenta de arena o por el colapso de una duna.", 
        "A pesar de llevar plumas, no podían volar ni planear. Los científicos creen que sus plumas posiblemente se usaron para regular la temperatura corporal, atraer parejas y posiblemente para proteger los huevos.",
        "Tenía una garra retráctil que usaba para matar, un arma letal como la uña de los felinos pero más alargada y gruesa y con forma de hoz."
      ]
    },
    {
      "id": 9,
      "name": "Deinonychus",
      "nameMeaning": "Garra terrible con contrapeso",
      "type": "Carnívoro",
      "weight": "72,5 a 100 kilogramos",
      "length": "3,4 a 4 metros",
      "height": "1,2 a 2 metros",
      "historicalPeriod": "Vivió en el Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676118496/deynonichus_rotado_rdikim.png",
      "foundIn": ["América del norte"],
      "diet": "Una presa habitual en su dieta era el Tenontosaurus ",
      "characteristics": "Su proporción de peso cerebral y corporal sugirió que ese era uno de los dinosaurios 'inteligentes'. Estaban muy especializados en movimientos rápidos y ataques feroces. Usaron su garra para cortar y cortar a su presa. Se cree que son una de las criaturas veloces de su tiempo. Deinonychus, como otras rapaces, podía correr 40 a una velocidad de millas por hora en promedio. Un estudio realizado en 2010 por Paul Gignac y su equipo sugirió que tenían una fuerza de mordida entre 4100 y 8200 newtons, que es mayor que la de una hiena moderna",
      "locomotion": "Bípedo",
      "habitat": "Llanura aluvial o región pantanosa",
      "facts": [
        "Inspiró la teoría de que las aves descienden de los dinosaurios.",
        "Los primeros fósiles fueron descubiertos en 1931.", 
        "Se representó de manera prominente en la novela Jurassic Park de Michael Crichton (y también en su adaptación cinematográfica de 1993 de Steven Spielberg). Pero Crichton eligió llamarlo 'Velociraptor' en lugar de Deinonychus porque era 'más dramático'.", 
        "El primer huevo de Deinonychus no se descubrió hasta el año 2000.",
        "Usó sus garras traseras para destripar presas."
      ]
    },
    {
      "id": 10,
      "name": "Tyrannosaurus Rex",
      "nameMeaning": "Rey de los lagartos tiranos",
      "type": "Carnívoro",
      "weight": "6350 a 6803 kilogramos",
      "length": "12,3 metros",
      "height": "4 metros",
      "historicalPeriod": "Vivió en el Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676118998/tyranosaurus-rex_j5j8xg.png",
      "foundIn": ["Oeste de América del Norte"],
      "diet": "Cualquier animal que pudiera atrapar o cazar",
      "characteristics": "Tenía un cráneo enorme que medía alrededor de 5 pies de largo. Su cerebro, casi cilíndrico y de forma alargada, era pequeño en comparación con su masa corporal total. Tenía una mandíbula de 4 pies de largo con dientes cónicos y aserrados. Tenían un cuello corto y musculoso en forma de S. Sus brazos, que eran literalmente más pequeños en comparación con su construcción general, tenían dos dedos con garras. Tenían extremidades posteriores grandes y poderosas. Tenía una cola larga y pesada que contenía alrededor de cuarenta vértebras. Los científicos creen que algunos de sus huesos estaban huecos para equilibrar su peso. No hay evidencia real de que T-rex poseyera plumas. Sin embargo, los científicos modernos creen que probablemente tenían plumas en algunas partes de su cuerpo, en algún momento de su edad. Se sugiere que la cubierta de plumas dependía del tamaño del animal, el clima, la edad y varios otros factores",
      "locomotion": "Bípedo",
      "habitat": "Valles fluviales boscosos, llanuras subtropicales y semiáridas costeras e interiores",
      "facts": [
        "Podría consumir hasta 226 kilos de comida en un solo bocado.",
        "Las aves son los parientes vivos más cercanos a este género.", 
        "Se ha representado en varias películas (Jurassic Park), documentales, líneas de juguetes (Papo, Lego), cómics para niños, películas de dibujos animados, películas de animación y videojuegos, entre otros.", 
        "El montaje del esqueleto se puede ver en muchos museos de todo el mundo, incluido el Museo Nacional de Historia de Londres.",
        "Con sus brazos notoriamente cortos, era incapaz de llevarse la comida a la boca. Y tampoco podía masticar. En vez de ello, tragaba carne y hueso enteros, usando los poderosos músculos del cuello para echar atrás la cabeza y arrojar el bocado al fondo de su boca."
      ]
    },
    {
      "id": 11,
      "name": "Archaeopteryx",
      "nameMeaning": "Primer pájaro' o Pájaro original",
      "type": "Carnívoro",
      "weight": "816 a 997 gramos",
      "length": "50 centímetros",
      "height": "20 a 25 centímetros",
      "historicalPeriod": "Vivió en el Período Jurásico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676141512/Archaeopteryx_mnecnu.png",
      "foundIn": ["La región alemana de Baviera"],
      "diet": "Insectos y pequeños vertebrados",
      "characteristics": "En cuanto al tamaño, eran similares a la urraca euroasiática. Sus características físicas eran más comunes con los dinosaurios mesozoicos de pequeño tamaño en comparación con las aves modernas. Tenían una cola huesuda, segundos dedos hiperextensibles, alas largas con extremos redondeados, tres dedos con garras y mandíbulas con dientes afilados y rasgos esqueléticos comunes con dromeosáuridos y troodóntidos. Los especímenes de Archaeopteryx mostraron que tenían plumas de vuelo y cola. El plumaje de su cuerpo era como el plumón. Un espécimen bien conservado mostró que su plumaje corporal incluía plumas bien desarrolladas en las patas",
      "locomotion": "Aéreo",
      "habitat": "Ambiente subtropical caracterizado por islas de arrecifes y lagunas en un mar poco profundo que formaba parte del Mediterráneo",
      "facts": [
        "Un estudio de 2009 realizado por Erickson, Zhongue, Norell y otros reveló que creció bastante más lento que las aves modernas.",
        "Alrededor de finales del siglo XIX y principios del XX, este género había sido visto como el ave más antigua jamás conocida. Pero después de eso, se han identificado probables aves mayores que incluyen a Aurornis, Xiaotingia y Anchiornis.", 
        "A partir de 1985, un grupo que incluía al físico Lee Spetner y al astrónomo Fred Hoyle presentó una serie de documentos que afirmaban que las muestras de Berlín y Londres habían sido falsificadas.", 
        "La obra de Alfred Jarry Ubu cocu, ou l'Archéopteryx muestra a Archaeopteryx como un personaje importante."
      ]
    },
    {
      "id": 12,
      "name": "Dilophosaurus",
      "nameMeaning": "Lagarto de doble cresta",
      "type": "Carnívoro",
      "weight": "295 a 454 kilogramos",
      "length": "6 metros",
      "height": "1,5 metros",
      "historicalPeriod": "Vivió en el Periodo Jurásico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676141953/dilophosaurus_dxsvib.png",
      "foundIn": ["Norteamérica", "Asia"],
      "diet": "Dinosaurios herbívoros más pequeños",
      "characteristics": "La investigación sobre los pocos especímenes sugirió que no tenían ningún dimorfismo sexual. Tanto el macho como la hembra eran similares en lo que respecta a la estructura de su esqueleto. Dilophosaurus era un depredador bípedo delgado y de rápido movimiento junto con dos crestas redondeadas delgadas y huesudas en la cabeza. Tenían manos cortas con tres dedos y piernas fuertes con pies de 4 dedos. También tenían un cuello curvo en forma de S",
      "locomotion": "Bípedo",
      "habitat": "En una selva tropical o en un entorno similar a un pantano",
      "facts": [
        "Las crestas de Dilophosaurus eran para atraer parejas o intimidar a un rival. Estudios recientes sugieren que en realidad fue para el reconocimiento dentro de las especies.",
        "Se cree que eran corredores relativamente rápidos.", 
        "Aparece en Jurassic Park de Michael Crichton, así como en su adaptación cinematográfica. A diferencia de lo que se muestra en la película Jurassic Park, no hay evidencia de que escupa veneno. Tampoco tenían volantes (también conocidos como solapas) como sugiere la película.", 
        "Su nombre fue dado por Samuel P. Welles en 1970.",
        "No tenían una gran fuerza de mordida en comparación con otros dinosaurios."
      ]
    },
    {
      "id": 13,
      "name": "Iguanodon",
      "nameMeaning": "Diente de iguana",
      "type": "Hervíboro",
      "weight": "3628 a 4536 kilogramos",
      "length": "6 a 10 metros",
      "height": "2,7 a 3 metros",
      "historicalPeriod": "Vivió en el Período Cretácico",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676142680/iguanodon_iocjoz.png",
      "foundIn": ["Bélgica", "Inglaterra", "España", "Francia"],
      "diet": "Se cree que comían principalmente equisetos y coníferas",
      "characteristics": "Tenía un cráneo largo y estrecho con un pico desdentado. Sin embargo, su mejilla estaba repleta de dientes apretados que eran similares a los de las iguanas, pero un poco más grandes. Tenían manos largas y robustas pero inflexibles. Tenía cuatro dedos en las patas delanteras junto con una punta cónica. Al principio se creía que las púas estaban presentes en la nariz de los animales, pero más tarde los investigadores sugirieron que estaban cerca de los dedos de sus patas delanteras. Las extremidades anteriores eran más pequeñas que las posteriores. Cada pie tenía tres dedos. Sus piernas eran piernas, pero no estaban hechas para correr",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanuras del bosque",
      "facts": [
        "Ha aparecido en varios documentales, películas y series de televisión, como la película de Disney Dinosaur, Walking with Dinosaurs de la BBC , Dinosaur Planet y Raptor Red, entre otros.",
        "Junto con Tyrannosaurus y Stegosaurus , Iguanodon fue uno de los géneros de dinosaurios que inspiró la aparición de Godzilla.", 
        "1989 CB3, un asteroide del cinturón principal, recibió el nombre de 9941 Iguanodon."
      ]
    }
]