[
    {
      "id": 1,
      "name": "Braquiosaurio",
      "nameMeaning": "Lagarto del brazo",
      "type": "Hervíboro",
      "weight": "3300 a 88000 kilogramos",
      "length": "26-30 metros",
      "height": "12 a 15 metros",
      "historicalPeriod": "Vivió en el Período Jurásico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676021958/Brachiosaurus_rotado_svztlb.png",
      "foundIn": ["Algeria", "Portugal", "Tanzania", "USA"],
      "diet": "Ginkgos, coníferas, helechos arborescentes y cicadáceas grandes (de gran variedad de plantas)",
      "characteristics": "Tiene el cuello extremadamente largo, un cráneo pequeño y gran tamaño general, todos los cuales son rasgos típicos de los saurópodos. Su apariencia se parecía a la apariencia de la jirafa moderna.",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanuras del bosque",
      "facts": [
        "Tenía las extremidades delanteras más largas que las traseras", 
        "Los adultos podrían vivir hasta los 100 años", 
        "Probablemente fue un homeotermo (temperatura corporal relativamente constante en cualquier momento del día)", 
        "Los restos fósiles fueron encontrados en 1903", 
        "Ha aparecido en varios documentales y películas, como Walking with Dinosaurs , Jurassic Park, etc."]
    },
    {
      "id": 2,
      "name": "Diplodocus",
      "nameMeaning": "Doble viga",
      "type": "Hervíboro",
      "weight": "30000 a 50000 kilogramos",
      "length": "36 metros",
      "height": "4,8 metros",
      "historicalPeriod": "Vivió en el Período Jurásico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676021958/diplodocus_rotado_umqn3v.png",
      "foundIn": ["USA"],
      "diet": "Àrboles, arbustos, cícadas, ginkgos y helechos (hierba, arbustos pequeños y hojas de árboles)",
      "characteristics": "Está entre los dinosaurios más fácilmente identificables, con su forma clásica, cuello y cola largos, y cuatro patas robustas. Durante muchos años, era el dinosaurio más grande conocido. Se cree que eran criaturas terrestres que vivían en manadas",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanura aluvial o entorno pantanoso",
      "facts": [
        "El cuello y la cola constaban de casi 100 vértebras",
        "No era el dinosaurio más inteligente del bloque jurásico", 
        "Probablemente mantuvo su cuello largo al nivel del suelo", 
        "El nombre artístico del DJ estadounidense, productor discográfico, rapero y compositor Thomas Wesley Pentz, Diplo, está inspirado en Diplodocus"]
    },
    {
      "id": 3,
      "name": "Stegosaurus",
      "nameMeaning": "Lagarto de techo",
      "type": "Hervíboro",
      "weight": "3800 a 7000 kilogramos",
      "length": "9 metros",
      "height": "4 metros",
      "historicalPeriod": "Vivió en el Período Jurásico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676035623/stegosaurus_qhwwux.png",
      "foundIn": ["África, Asia, Europa y Norteamérica"],
      "diet": "Comía plantas, en gran parte coníferas, helechos y helechos con semillas",
      "characteristics": "Muy popular por las placas que recorrían todo su cuerpo desde la cabeza a la cola, y cuya función le permitía regular la temperatura corporal, el Estegosaurio también se caracterizaba por un grupo de espinas gigantes en el extremo de la cola, muy utilizadas para defenderse  la espalda plateada.  O tenía una distintiva e inusual postura, con un lomo fuertemente arqueado, los miembros anteriores cortos, la cabeza cerca del suelo y la cola rígida sostenida en el aire.",
      "locomotion": "Cuadrúpedo",
      "habitat": "Bosques o llanuras",
      "facts": [
        "Tenía un cerebro del tamaño de una nuez",
        "Los paleontólogos alguna vez pensaron que tenía un cerebro en su trasero", 
        "Complementó su dieta con pequeñas rocas", 
        "Vivían en manadas formadas por adultos y bebés",
        "Alguna vez se pensó que caminaba sobre dos patas"]
    },
    {
      "id": 4,
      "name": "Triceratops",
      "nameMeaning": "Cara de tres cuernos",
      "type": "Hervíboro",
      "weight": "6100 a 12000 kilogramos",
      "length": "7,9 a 9 metros",
      "height": "3 metros",
      "historicalPeriod": "Vivió a finales del Período Cretácico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676035213/triceraptor_islqjb.png",
      "foundIn": ["USA"],
      "diet": "Plantas de crecimiento bajo",
      "characteristics": "Estaba dotado de unos impresionantes cuernos y una placa frontal. Utilizaba sus cuernos, uno corto sobre la boca y dos largos sobre sus ojos para embestir contra depredadores como el T. rex. Probablemente también eran utilizados en rituales de apareamiento.",
      "locomotion": "Cuadrúpedo",
      "habitat": "Llanuras del bosque",
      "facts": [
        "El cráneo era un tercio de su cuerpo",
        "Fue considerado alimento para Tyrannosaurus Rex", 
        "Tenía un pico duro como el de un loro", 
        "La apariencia era en gran medida como la del rinoceronte moderno",
        "Los fósiles son artículos preciados de coleccionista"]
    },
    {
      "id": 5,
      "name": "Protoceratops",
      "nameMeaning": "Primera cara con cuernos",
      "type": "Hervíboro",
      "weight": "23700 a 82700 kilogramos",
      "length": "1,8 metros",
      "height": "60 centímetros",
      "historicalPeriod": "Vivió a finales del Período Cretácico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676035213/protoceraptor_mxszhl.png",
      "foundIn": ["En el desierto de Gobi en Mongolia"],
      "diet": "Se alimentaba de las hojas de los arboles pequeños sobre todo de hojas ricas en fibras",
      "characteristics": "Era un dinosaurio relativamente pequeño con una enorme cabeza. Aunque fue un herbívoro, parece haber tenido una poderosa mordida. Estas mandíbulas tenían grandes baterías de dientes bien adaptados para masticar la vegetación resistente.",
      "locomotion": "Cuadrúpedo",
      "habitat": "Hábitat árido y seco con fauna y flora diversa",
      "facts": [
        "Estaba en el menú de la cena de Velociraptor",
        "Compartió su hábitat con Oviraptor", 
        "Roy Chapman Andrews los descubrió", 
        "Los lechos de huesos fosilizados indican que vivían en manada",
        "Tenía un pico de loro y dientes en las mejillas"]
    },
    {
      "id": 6,
      "name": "Troodon",
      "nameMeaning": "Diente hiriente",
      "type": "Carnívoro",
      "weight": "45 a 50 kilogramos",
      "length": "2 a 3,3 metros",
      "height": "70 a 90 centímetros",
      "historicalPeriod": "Vivió en el Período Cretácico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676036401/Troodon_ww1de9.png",
      "foundIn": ["América del norte"],
      "diet": "Se alimentaba de pequeños invertebrados, mamíferos y reptiles",
      "characteristics": "Sus características anatómicas sugieren que eran verdaderos depredadores en su hábitat. Sus hallazgos fósiles cerca del norte, e incluso áreas árticas determinan que preferían regiones más frías. Sus estrategias reproductivas eran en parte similares a las de los cocodrilos y las aves. Los investigadores sugirieron que Troodon produjo dos huevos a intervalos periódicos durante unos diez días y los incubaron en nidos en el suelo. Eran corredores rápidos y probablemente llevaban un estilo de vida en parte nocturno.",
      "locomotion": "Bípedo",
      "habitat": "Bosques de lo que hoy es Norteamérica",
      "facts": [
        "Tenía un cerebro más grande que la mayoría de los dinosaurios",
        "Prosperó en climas más fríos", 
        "Puso nidadas de 16 a 24 huevos a la vez", 
        "Tenía visión binocular",
        "Podría haber desarrollado un nivel humano de inteligencia",
        "Se representaba como un dinosaurio con la piel desnuda. Pero los investigadores modernos sugieren que su cuerpo estaba cubierto de plumas primitivas."]
    },
    {
      "id": 7,
      "name": "Utahraptor",
      "nameMeaning": "Ladrón de Utah",
      "type": "Carnívoro",
      "weight": "499 kilogramos",
      "length": "5 a 7 metros",
      "height": "1,7 metros",
      "historicalPeriod": "Vivió en el Período Cretácico.",
      "picture": "https://res.cloudinary.com/dpqw97rqh/image/upload/v1676056898/utahraptors_oqfgwu.png",
      "foundIn": ["USA"],
      "diet": "Se alimentaba de otros dinosaurios y algunos mamíferos que cazaban",
      "characteristics": "Era un dinosaurio con un cuerpo lo bastante adaptado para ser ágil y rápido, además, poseía una característica muy inusual, ya que tenía unos brazos relativamente largos y al final tenía unas garras los bastante afiladas que sin duda representan una gran ventaja al momento de cazar, debido a que seguramente le facilitaba agarrar sus presas. es considerado uno de los mejores depredadores de la historia junto a otros especímenes, ya que estaba dotado con todo lo necesario para hacer frente a cualquier presa, y es que la velocidad combinada con su gran equipamiento de garras y dientes no dejó indiferente a los amantes de la prehistoria.",
      "locomotion": "Bípedo",
      "habitat": "Bosques, praderas y desiertos.",
      "facts": [
        "Es el raptor más grande descubierto hasta ahora",
        "Las garras en las patas traseras tenían casi un pie de largo", 
        "Es la estrella de la novela 'Raptor Red'", 
        "Actualmente en muchas ilustraciones se plasma al Utahraptor con plumas, sin embargo, esto es solo especulación y no está probado. Ya que no se encontraron signos de plumas",
        "Este cazador también está presente en el juego de ordenador 'ARK: supervivencia con dinosaurios'"
      ]
    }
]